
## Plan Result




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.key_vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.key_vault.azurerm_user_assigned_identity.managed_identity[0]
* Update
  * module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.key_vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat|rpx-aat"
        name                       = "rpx-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.key_vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "rpx-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/rpx-shared-infrastructure.git"
          + "Team Contact"        = "#expert-ui"
          + "application"         = "professional-applications"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "staging"
          + "managedBy"           = "Professional Applications"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Vars":{}} -->